app/controllers/api/v1/tours.rb

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1  ORDER BY "tours"."id" ASC LIMIT 1
---
          requires :id, type: String, desc: "ID of the tour"
        end
        get ":id", root: "tour" do
          Tour.where(id: permitted_params[:id]).first!